# Task 2

## Task 1: Create DataFrame

In [23]:
import pandas as pd 
grades_dict = {'Wally': [67, 78, 92], 'Eva': [99, 87, 92], 'Sam': [67, 72, 70], 'Katie': [34, 82, 89], 'Bob': [77, 76, 72]}
grades = pd.DataFrame(grades_dict)
grades

   Wally  Eva  Sam  Katie  Bob
0     67   99   67     34   77
1     78   87   72     82   76
2     92   92   70     89   72

## Task 2: Custom Index

In [24]:
grades.index = ['Test1', 'Test2', 'Test3']
grades

       Wally  Eva  Sam  Katie  Bob
Test1     67   99   67     34   77
Test2     78   87   72     82   76
Test3     92   92   70     89   72

In [25]:
grades_dict['Eva']

[99, 87, 92]

In [26]:
grades.Sam

Test1    67
Test2    72
Test3    70
Name: Sam, dtype: int64